#### OrdinateTextOrientation Enumeration

---

|  |
| --- |
| See Also |

The ordinate dimension text orientation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum OrdinateTextOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration OrdinateTextOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class OrdinateTextOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| ParallelToDimensionLine | The dimension text orientation will be parallel to dimension line. |
| ParallelToWitnessLine | The dimension text orientation will be parallel to witness line. |

# See Also

Autodesk.Revit.DB Namespace